# Development
brew "git"              # Distributed revision control system
brew "gh"               # GitHub command-line tool
brew "make"             # Utility for directing compilation
brew "neovim"           # Ambitious Vim-fork focused on extensibility and agility

# Utilities
brew "curl"             # Get a file from an HTTP, HTTPS or FTP server
brew "ffmpeg"           # Play, record, convert, and stream audio and video
brew "fzf"              # Command-line fuzzy finder written in Go
brew "stow"             # Organize software neatly under a single directory tree
brew "tmux"             # Terminal multiplexer
brew "tree"             # Display directories as trees (with optional color/HTML output)
brew "zoxide"           # Shell extension to navigate your filesystem faster

# Shell
brew "spaceship"                # Zsh prompt for Astronauts
brew "zsh-autosuggestions"      # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-syntax-highlighting"  # Fish shell like syntax highlighting for zsh

# Applications
cask "flux-app"         # Screen colour temperature controller
cask "ghostty"          # Terminal emulator that uses platform-native UI and GPU acceleration
cask "karabiner-elements"  # Keyboard customiser
cask "keepingyouawake"  # Tool to prevent the system from going into sleep mode
cask "rectangle"        # Move and resize windows using keyboard shortcuts or snap areas
cask "vscodium"         # Binary releases of VS Code without MS branding/telemetry/licensing
cask "alfred"           # Application launcher and productivity software

# Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
